`PVD 27-11-2020`
#### Series

In [2]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series([4, 5, 6, 7])
obj

0    4
1    5
2    6
3    7
dtype: int64

In [4]:
obj.values

array([4, 5, 6, 7], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2['a'] = 9
obj2

d    4
b    7
a    9
c    3
dtype: int64

In [11]:
obj2[obj2 > 3]

d    4
b    7
a    9
dtype: int64

In [12]:
obj2 * 2

d     8
b    14
a    18
c     6
dtype: int64

In [13]:
'b' in obj2

True

In [18]:
sdata = {'Ohio': 35000, 'Texas': 32435, 'Oregon': 71000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     32435
Oregon    71000
Utah       5000
dtype: int64

In [19]:
states = {'California', 'Texas', 'Ohio', 'Oregon'}
obj4 = pd.Series(sdata, index = states)
obj4

Oregon        71000.0
Texas         32435.0
Ohio          35000.0
California        NaN
dtype: float64

In [20]:
pd.isnull(obj4)

Oregon        False
Texas         False
Ohio          False
California     True
dtype: bool

In [21]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon        142000.0
Texas          64870.0
Utah               NaN
dtype: float64

In [23]:
obj4.name = 'Population'
obj4

Oregon        71000.0
Texas         32435.0
Ohio          35000.0
California        NaN
Name: Population, dtype: float64

In [24]:
obj

0    4
1    5
2    6
3    7
dtype: int64

In [25]:
obj.index = ['bob', 'steve', 'jeff', 'clif']
obj

bob      4
steve    5
jeff     6
clif     7
dtype: int64

`PVD 30-11-2020`
#### DataFrame

In [4]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [5]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [6]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [7]:
pd.DataFrame(data, columns = ['pop', 'year', 'state'])

   pop  year   state
0  1.5  2000    Ohio
1  1.7  2001    Ohio
2  3.6  2002    Ohio
3  2.4  2001  Nevada
4  2.9  2002  Nevada
5  3.2  2003  Nevada

In [9]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], 
                      index = ['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [10]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [11]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [12]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [13]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [14]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [16]:
import numpy as np 
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [17]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [18]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

`LAB 9-12-2020`

#### Dropping Entries from an Axis

In [5]:
#obj = pd.Series(np.arange())
import glob
import numpy as np

`PVD 11-12-2020`

#### Integer Indexes

In [6]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

#### Arithmetic and Data Alignment

`PVD LAB: 12-12-2020`

In [74]:
data = {'Transaction date': ['12-10-2020', '02-10-2020', '22-12-2020', '02-10-2020', '10-03-2020', 
                             '11-11-2020', '16-09-2020', '13-11-2020', '11-03-2020', '15-09-2020' ],
        'Realtor' : ['Phil', 'Gill', 'Gill', 'Gill', 'Phil', 'Sofia', 'Phil', 'Gill', 'Sofia', 'Phil'],
        'Agency' : ['Dunphy', 'Thorp', 'Thorp', 'Thorp', 'Dunphy', 'Dunphy', 'Dunphy', 'Thorp', 'Dunphy', 'Dunphy'] }
df = pd.DataFrame(data)
df

  Transaction date Realtor  Agency
0       12-10-2020    Phil  Dunphy
1       02-10-2020    Gill   Thorp
2       22-12-2020    Gill   Thorp
3       02-10-2020    Gill   Thorp
4       10-03-2020    Phil  Dunphy
5       11-11-2020   Sofia  Dunphy
6       16-09-2020    Phil  Dunphy
7       13-11-2020    Gill   Thorp
8       11-03-2020   Sofia  Dunphy
9       15-09-2020    Phil  Dunphy

In [75]:
df['Transaction date'] = pd.to_datetime(df['Transaction date'])
df

pd.to_datetime()

  Transaction date Realtor  Agency
0       2020-12-10    Phil  Dunphy
1       2020-02-10    Gill   Thorp
2       2020-12-22    Gill   Thorp
3       2020-02-10    Gill   Thorp
4       2020-10-03    Phil  Dunphy
5       2020-11-11   Sofia  Dunphy
6       2020-09-16    Phil  Dunphy
7       2020-11-13    Gill   Thorp
8       2020-11-03   Sofia  Dunphy
9       2020-09-15    Phil  Dunphy

In [61]:
df['Rank_Realtor_by_close_date'] = df.groupby('Realtor')['Transaction date'].rank(method='first')
df

  Transaction date Realtor  Agency  Rank_Realtor_by_close_date
0       2020-12-10    Phil  Dunphy                         4.0
1       2020-02-10    Gill   Thorp                         1.0
2       2020-12-22    Gill   Thorp                         4.0
3       2020-02-10    Gill   Thorp                         2.0
4       2020-10-03    Phil  Dunphy                         3.0
5       2020-11-11   Sofia  Dunphy                         2.0
6       2020-09-16    Phil  Dunphy                         2.0
7       2020-11-13    Gill   Thorp                         3.0
8       2020-11-03   Sofia  Dunphy                         1.0
9       2020-09-15    Phil  Dunphy                         1.0

In [66]:
df = df.sort_values(by=['Realtor', 'Rank_Realtor_by_close_date'])
df

  Transaction date Realtor  Agency  Rank_Realtor_by_close_date
1       2020-02-10    Gill   Thorp                         1.0
3       2020-02-10    Gill   Thorp                         2.0
7       2020-11-13    Gill   Thorp                         3.0
2       2020-12-22    Gill   Thorp                         4.0
9       2020-09-15    Phil  Dunphy                         1.0
6       2020-09-16    Phil  Dunphy                         2.0
4       2020-10-03    Phil  Dunphy                         3.0
0       2020-12-10    Phil  Dunphy                         4.0
8       2020-11-03   Sofia  Dunphy                         1.0
5       2020-11-11   Sofia  Dunphy                         2.0

AttributeError: 'DataFrame' object has no attribute 'duplicate'

In [73]:
df[df['Rank_Realtor_by_close_date']==1].groupby('Transaction date').size().reset_index().rename(columns={0: 'Count'})

  Transaction date  Count
0       2020-02-10      1
1       2020-09-15      1
2       2020-11-03      1